src/BusinessProcesses/ЗапросНаАктуализациюКаталогаПоставщика/ЗапросНаАктуализациюКаталогаПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ЗапросНаАктуализациюКаталогаПоставщика</name>
  <basedOn>Task.ЗадачаИсполнителя</basedOn>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <comment>Важность задач точки действия Выполнить для исполнителя</comment>
    <type>
      <types>EnumRef.ВариантыВажностиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнено</name>
    <comment>Результат выполнения задания после завершения бизнес-процесса.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавнаяЗадача</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <comment>Фактическая дата завершения бизнес-процесса</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <comment>Описание задания</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаПроверке</name>
    <comment>Признак того, что указан проверяющий по задаче</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИтерации</name>
    <comment>Количество циклов бизнес-процесса между исполнителем и проверяющим</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подтверждено</name>
    <comment>Внутреннее состояние бизнес-процесса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <comment>Объект системы, &quot;по поводу&quot; которого был создан бизнес-процесс.</comment>
    <type>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверяющий</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <comment>История переписки исполнителя и проверяющего</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияБизнесПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнееЗадание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаИсточник</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеПредмета</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресацииПроверяющий</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресацииПроверяющий</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИсполнителейЗадач</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ГруппыИсполнителейЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИсполнителейЗадачПроверяющий</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ГруппыИсполнителейЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗаполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредметыСнабжения</name>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Входимость</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обозначение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументНаПоставку</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозможностьИзготовления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИзготовления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЦены</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПравилаУпаковкиТранспортировкиХранения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаКартинки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходимостьОбозначение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеБД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбозначениеБД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументНаПоставкуБД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозможностьИзготовленияБД</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИзготовленияБД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЦеныБД</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПравилаУпаковкиТранспортировкиХраненияБД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеИзменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбозначениеИзменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументНаПоставкуИзменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВозможностьИзготовленияИзменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИзготовленияИзменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИзменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЦеныИзменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилаУпаковкиТранспортировкиХраненияИзменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьИзменения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеКартинки</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Характеристики</name>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияБД</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеБД</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнаяБД</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияИзменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеИзменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнаяИзменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьИзменения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторАналога</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

src/BusinessProcesses/ЗапросНаАктуализациюКаталогаПоставщика/Forms/ФормаВыбораИзКаталога/Module.bsl
//////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


 &НаСервере
Процедура ОчиститьНаСервере()
   Дерево = РеквизитФормыВЗначение("ДеревоСтруктуры");  
   Дерево.Строки.Очистить();  
   ЗначениеВРеквизитФормы(Дерево, "ДеревоСтруктуры");
КонецПроцедуры  

&НаСервере
Функция ПолучитьТаблицуДанных()
	Запрос 			= Новый Запрос;
	#Область ТекстЗапроса
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Ссылка КАК ЭлементСтруктуры,
	             	  |	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Родитель КАК Родитель,
	             	  |	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПредметСнабжения КАК ПредметСнабжения,
	             	  |	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Количество КАК Количество,
	             	  |	ЕСТЬNULL(КодыINCATПредставление.Представление, """") КАК КодINCAT,
	             	  |	ВЫБОР
	             	  |		КОГДА СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Тип = ЗНАЧЕНИЕ(Справочник.ТипыУзловЭлектроннойСтруктурыКомплектующихИзделийИЗИПКорабля.Группа)
	             	  |				И НЕ СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПометкаУдаления
	             	  |			ТОГДА 0
	             	  |		КОГДА СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Тип = ЗНАЧЕНИЕ(Справочник.ТипыУзловЭлектроннойСтруктурыКомплектующихИзделийИЗИПКорабля.Группа)
	             	  |				И СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПометкаУдаления
	             	  |			ТОГДА 1
	             	  |		КОГДА СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Тип = ЗНАЧЕНИЕ(Справочник.ТипыУзловЭлектроннойСтруктурыКомплектующихИзделийИЗИПКорабля.Изделие)
	             	  |				И СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ЕстьПодчиненные
	             	  |				И НЕ СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПометкаУдаления
	             	  |			ТОГДА 2
	             	  |		КОГДА СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Тип = ЗНАЧЕНИЕ(Справочник.ТипыУзловЭлектроннойСтруктурыКомплектующихИзделийИЗИПКорабля.Изделие)
	             	  |				И СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ЕстьПодчиненные
	             	  |				И СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПометкаУдаления
	             	  |			ТОГДА 3
	             	  |		КОГДА СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Тип = ЗНАЧЕНИЕ(Справочник.ТипыУзловЭлектроннойСтруктурыКомплектующихИзделийИЗИПКорабля.Изделие)
	             	  |				И НЕ СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ЕстьПодчиненные
	             	  |				И НЕ СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПометкаУдаления
	             	  |			ТОГДА 4
	             	  |		КОГДА СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Тип = ЗНАЧЕНИЕ(Справочник.ТипыУзловЭлектроннойСтруктурыКомплектующихИзделийИЗИПКорабля.Изделие)
	             	  |				И НЕ СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ЕстьПодчиненные
	             	  |				И СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПометкаУдаления
	             	  |			ТОГДА 5
	             	  |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	             	  |	КОНЕЦ КАК ИДТипа,
	             	  |	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.КоличествоВЗИПБорт КАК КоличествоВЗИПБорт,
	             	  |	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.КоличествоВЗИПБаза КАК КоличествоВЗИПБаза,
	             	  |	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.КоличествоВЗИПДЭ КАК КоличествоВЗИПДЭ,
	             	  |	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.КоличествоВЗИПР КАК КоличествоВЗИПР,
	             	  |	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ЗИП КАК ЗИП
	             	  |ПОМЕСТИТЬ ВТ_ЭлементыСтруктуры
	             	  |ИЗ
	             	  |	Справочник.СтруктураЗаказаПоКомплектующимИзделиямИЗИП КАК СтруктураЗаказаПоКомплектующимИзделиямИЗИП
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыINCATПредставление КАК КодыINCATПредставление
	             	  |		ПО СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПредметСнабжения = КодыINCATПредставление.ПредметСнабжения
	             	  |ГДЕ
	             	  |	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Владелец = &Заказ
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             	  |	КаталогПредметовСнабженияИзготовителиИПоставщики.Ссылка КАК ПредметСнабжения,
	             	  |	КаталогПредметовСнабженияИзготовителиИПоставщики.Ссылка.Обозначение КАК Обозначение,
	             	  |	КаталогПредметовСнабженияИзготовителиИПоставщики.Ссылка.ДокументНаПоставку КАК ДокументНаПоставку
	             	  |ПОМЕСТИТЬ ВТ_ПредметыСнабженияПоставщика
	             	  |ИЗ
	             	  |	Справочник.КаталогПредметовСнабжения.ИзготовителиИПоставщики КАК КаталогПредметовСнабженияИзготовителиИПоставщики
	             	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЭлементыСтруктуры КАК ВТ_ЭлементыСтруктуры
	             	  |		ПО КаталогПредметовСнабженияИзготовителиИПоставщики.Ссылка = ВТ_ЭлементыСтруктуры.ПредметСнабжения
	             	  |ГДЕ
	             	  |	КаталогПредметовСнабженияИзготовителиИПоставщики.Контрагент = &Поставщик
	             	  |	И КаталогПредметовСнабженияИзготовителиИПоставщики.Поставщик
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ВТ_ЭлементыСтруктуры.ЭлементСтруктуры КАК ЭлементСтруктуры,
	             	  |	ВТ_ЭлементыСтруктуры.Родитель КАК Родитель,
	             	  |	ВТ_ЭлементыСтруктуры.ПредметСнабжения КАК ПредметСнабжения,
	             	  |	ВТ_ЭлементыСтруктуры.Количество КАК Количество,
	             	  |	ВТ_ЭлементыСтруктуры.КодINCAT КАК КодINCAT,
	             	  |	ВЫБОР
	             	  |		КОГДА ЕСТЬNULL(ВТ_ПредметыСнабженияПоставщика.ПредметСнабжения, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	             	  |			ТОГДА ЛОЖЬ
	             	  |		ИНАЧЕ ИСТИНА
	             	  |	КОНЕЦ КАК Целевой,
	             	  |	ВТ_ЭлементыСтруктуры.ИДТипа КАК ИДТипа,
	             	  |	ВТ_ЭлементыСтруктуры.КоличествоВЗИПБорт КАК КоличествоВЗИПБорт,
	             	  |	ВТ_ЭлементыСтруктуры.КоличествоВЗИПБаза КАК КоличествоВЗИПБаза,
	             	  |	ВТ_ЭлементыСтруктуры.КоличествоВЗИПДЭ КАК КоличествоВЗИПДЭ,
	             	  |	ВТ_ЭлементыСтруктуры.КоличествоВЗИПР КАК КоличествоВЗИПР,
	             	  |	ВТ_ЭлементыСтруктуры.ЗИП КАК ЗИП,
	             	  |	ВТ_ПредметыСнабженияПоставщика.Обозначение КАК Обозначение,
	             	  |	ВТ_ПредметыСнабженияПоставщика.ДокументНаПоставку КАК ДокументНаПоставку
	             	  |ИЗ
	             	  |	ВТ_ЭлементыСтруктуры КАК ВТ_ЭлементыСтруктуры
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПредметыСнабженияПоставщика КАК ВТ_ПредметыСнабженияПоставщика
	             	  |		ПО ВТ_ЭлементыСтруктуры.ПредметСнабжения = ВТ_ПредметыСнабженияПоставщика.ПредметСнабжения";
	#КонецОбласти
	Запрос.УстановитьПараметр("Поставщик", Параметры.ПоставщикПараметр);
	Запрос.УстановитьПараметр("Заказ", ЭтотОбъект.Заказ);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьТаблицуДанных


&НаСервере
Функция ПолучитьТаблицуДанныхДерева()
	ТаблицаДанных 			= ПолучитьТаблицуДанных();
	ТаблицаДанныхЦелевые 	= ТаблицаДанных.Скопировать(Новый Структура("Целевой", Истина));
	ТаблицаДанныхИтоговая	= ТаблицаДанныхЦелевые.Скопировать();
	ТаблицаДанныхИтоговая.Очистить();
	Для Каждого СтрокаТаблицы Из ТаблицаДанныхЦелевые Цикл
		ТекущаяСтрока = СтрокаТаблицы;
		Пока Истина Цикл			
			НайденныеСтроки = ТаблицаДанныхИтоговая.НайтиСтроки(Новый Структура("ЭлементСтруктуры", ТекущаяСтрока.ЭлементСтруктуры));
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока = ТаблицаДанныхИтоговая.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			ИначеЕсли ТекущаяСтрока.Целевой Тогда
				НайденныеСтроки[0].Целевой = Истина;
			КонецЕсли; // Если НайденныеСтроки.Количество() = 0 Тогда
			
			Если ТекущаяСтрока.Родитель = Справочники.СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПустаяСсылка() Тогда
				Прервать;
			КонецЕсли; // Если ТекущаяСтрока.Родитель = Справочники.СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПустаяСсылка() Тогда
			
			РодительскиеСтроки = ТаблицаДанных.НайтиСтроки(Новый Структура("ЭлементСтруктуры", ТекущаяСтрока.Родитель));
			Если РодительскиеСтроки.Количество() = 0 Тогда
				Прервать;
			Иначе
				ТекущаяСтрока = РодительскиеСтроки[0];
			КонецЕсли; // Если РодительскиеСтроки.Количество() = 0 Тогда
		КонецЦикла; // 	Пока Истина Цикл	
	КонецЦикла; // Для Каждого СтрокаТаблицы Из ТаблицаДанныхЦелевые Цикл
	
	Возврат ТаблицаДанныхИтоговая;
КонецФункции // ПолучитьТаблицуДанныхДерева

&НаСервере
Процедура ДобавитьСтроки(ТаблицаДанных, ТекущийРодитель, ТекущийУзел)
	Для каждого СтрокаТаблицы Из ТаблицаДанных.НайтиСтроки(Новый Структура("Родитель", ТекущийРодитель)) Цикл
		НоваяСтрока = ТекущийУзел.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		ДобавитьСтроки(ТаблицаДанных, СтрокаТаблицы.ЭлементСтруктуры, НоваяСтрока);
	КонецЦикла; // Для Каждого СтрокаТаблицы Из ТаблицаДанных.НайтиСтроки(Новый Структура("Родитель", ТекущийРодитель)) Цикл
КонецПроцедуры // ДобавитьСтроки

&НаСервере
Процедура ЗаполнитьДерево()
	ДеревоЗначений	 	= РеквизитФормыВЗначение("ДеревоСтруктуры");
	ТаблицаДанных 		= ПолучитьТаблицуДанныхДерева(); 	
	ТекущийРодитель 	= Справочники.СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПустаяСсылка();
	ДобавитьСтроки(ТаблицаДанных, ТекущийРодитель, ДеревоЗначений);
	ДеревоЗначений.Строки.Сортировать("ЭлементСтруктуры", Истина);
	ЗначениеВДанныеФормы(ДеревоЗначений, ДеревоСтруктуры);
	
	Элементы.ДеревоСтруктуры.ИзменятьПорядокСтрок = Ложь;
	Элементы.ДеревоСтруктуры.ИзменятьСоставСтрок = Ложь;

КонецПроцедуры // ЗаполнитьДерево


&НаКлиенте
Процедура ВыбратьСтроки(ПодчиненныеСтроки, Выбор)	
	Для каждого Строка из ПодчиненныеСтроки Цикл		
		  Строка.Выбран = Выбор;
		  ВложенныеСтроки = Строка.ПолучитьЭлементы();  		  
		  Если ВложенныеСтроки.Количество() > 0 Тогда
			  ВыбратьСтроки(ВложенныеСтроки, Выбор);
		  КонецЕсли;		
	КонецЦикла;	  
КонецПроцедуры // ВыбратьСтроки	


&НаСервере
Функция СформироватьМассив()	
	МассивПС	= Новый Массив;
	Дерево		= РеквизитФормыВЗначение("ДеревоСтруктуры");
	ОбойтиСтроки(Дерево, МассивПС);
	Возврат МассивПС;	
КонецФункции // СформироватьМассив 

&НаСервере
Процедура ОбойтиСтроки(Дерево, МассивПС, Предыдущий = Неопределено)	
	Для каждого Строка из Дерево.Строки Цикл
		Если Строка.Выбран и Строка.Целевой Тогда
			МассивПара = Новый Массив;
			МассивПара.Добавить(Строка.ПредметСнабжения);
			Если Предыдущий	= Неопределено Тогда
				Предыдущий	= Справочники.КаталогПредметовСнабжения.ПустаяСсылка();
			КонецЕсли;	
			МассивПара.Добавить(Предыдущий);
		 	МассивПС.Добавить(МассивПара);
		КонецЕсли;		  		  
		Если Строка.Строки.Количество() > 0 Тогда
			ОбойтиСтроки(Строка, МассивПС, Строка.ПредметСнабжения);
		КонецЕсли;		
	  КонецЦикла;	  
КонецПроцедуры	// ОбойтиСтроки


&НаКлиенте
Процедура ВыделитьВсеДетально(ПодчиненныеСтроки)
	Для каждого Строка из ПодчиненныеСтроки Цикл
		Строка.Выбран = Истина;
		Если Строка.ПолучитьЭлементы().Количество() > 0 Тогда
			  ВыделитьВсеДетально(Строка.ПолучитьЭлементы());
		 КонецЕсли;
	КонецЦикла;	
 КонецПроцедуры // ВыделитьВсеДетально
 

&НаКлиенте
Процедура СнятьВсеДетально(ПодчиненныеСтроки)
	Для каждого Строка из ПодчиненныеСтроки Цикл
		Строка.Выбран = Ложь;
		 Если Строка.ПолучитьЭлементы().Количество() > 0 Тогда
			  СнятьВсеДетально(Строка.ПолучитьЭлементы());
		 КонецЕсли;
	 КонецЦикла;
КонецПроцедуры // СнятьВсеДетально


//////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД


&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Заказ) Тогда 
		Сообщение		= Новый СообщениеПользователю();
		Сообщение.Текст	= "Выберите заказ!";
		Сообщение.Поле	= "Заказ";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();  		
	Иначе
		ОчиститьНаСервере();
		ЗаполнитьДерево();		
	КонецЕсли;
КонецПроцедуры // КомандаЗаполнить

&НаКлиенте
Процедура Выбрать(Команда) 
	ЭтаФорма.Закрыть(СформироватьМассив());	
КонецПроцедуры //Выбрать

&НаКлиенте
Процедура ВыделитьВсе(Команда)	
	ПодчиненныеСтроки = ДеревоСтруктуры.ПолучитьЭлементы();
	ВыделитьВсеДетально(ПодчиненныеСтроки);	
КонецПроцедуры // ВыделитьВсе

&НаКлиенте
Процедура СнятьВсе(Команда)	
	ПодчиненныеСтроки = ДеревоСтруктуры.ПолучитьЭлементы();
	СнятьВсеДетально(ПодчиненныеСтроки);	
КонецПроцедуры // СнятьВсе 
 


//////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаКлиенте
Процедура ДеревоЗначенийВыбранПриИзменении(Элемент)	
	ИдСтроки		= Элементы.ДеревоСтруктуры.ТекущаяСтрока; 
	ВыбратьВсе		= ЭтотОбъект.ВыделятьПодчиненные;
	ТекущаяСтрока	= ДеревоСтруктуры.НайтиПоИдентификатору(ИдСтроки); 	
	Если ВыбратьВсе Тогда		
		Выбор 				= ТекущаяСтрока.Выбран;
		ПодчиненныеСтроки 	= ТекущаяСтрока.ПолучитьЭлементы();		
		Если ПодчиненныеСтроки.Количество() > 0 Тогда
			ВыбратьСтроки(ПодчиненныеСтроки, Выбор);
		КонецЕсли;		
	КонецЕсли; 	
КонецПроцедуры // ДеревоЗначенийВыбранПриИзменении


&НаКлиенте
Процедура ДеревоСтруктурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	ПоказатьЗначение(, Элемент.ТекущиеДанные.ЭлементСтруктуры);	
КонецПроцедуры // ДеревоСтруктурыВыбор
